Revit 2027 API
ElectricalSystem.CircuitType Property
 The circuit type of the Electrical System.
Namespace: Autodesk.Revit.DB.Electrical
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public CircuitType CircuitType { get; }
Public ReadOnly Property CircuitType As CircuitType
	Get
public:
property CircuitType CircuitType {
	CircuitType get ();
}
member CircuitType : CircuitType with get
Property Value
CircuitType
Remarks
 This read-only property is used to retrieve the circuit type of the Electrical System.
See Also
Reference
ElectricalSystem Class
Autodesk.Revit.DB.Electrical Namespace